//
//  Grade4.swift
//  PracticalJapanese
//
//  Created by Ryan Kanno on 2/20/21.
//  Copyright © 2021 Ryan Kanno. All rights reserved.
//

import Foundation

struct Grade4 {
    let kanji:[String] = [
        "愛", "案", "以", "位", "衣",
        "印", "英", "栄", "塩", "億",
        "貨", "課", "加", "果", "芽",
        "械", "改", "害", "街", "覚",
        "各", "関", "完", "管", "官",
        "親", "願", "季", "旗", "希",
        "機", "器", "議", "泣", "求",
        "給", "挙", "協", "鏡", "競",
        "共", "極", "訓", "軍", "郡",
        "径", "景", "芸", "結", "欠",
        "建", "健", "験", "固", "候",
        "功", "好", "康", "差", "最",
        "菜", "材", "昨", "刷", "札",
        "察", "参", "散", "産", "残",
        "氏", "試", "司", "治", "児",
        "辞", "失", "借", "種", "周",
        "祝", "順", "初", "唱", "笑",
        "焼", "松", "照", "省", "信",
        "臣", "清", "静", "成", "席",
        "積", "節", "折", "説", "戦",
        "選", "浅", "巣", "争", "倉",
        "束", "側", "続", "卒", "孫",
        "隊", "帯", "達", "単", "置",
        "仲", "兆", "低", "底", "的",
        "典", "伝", "徒", "努", "灯",
        "働", "持", "熱", "然", "念",
        "敗", "梅", "博", "飯", "飛",
        "必", "票", "標", "付", "府",
        "不", "夫", "無", "副", "兵",
        "別", "辺", "変", "便", "法",
        "包", "望", "牧", "末", "満",
        "未", "民", "約", "勇", "要",
        "養", "浴", "利", "陸", "量",
        "良", "漁", "料", "輪", "類",
        "令", "冷", "例", "連", "老",
        "労", "録", "賀", "群", "徳",
        "富", "城", "香", "井", "沖",
        "岐", "潟", "佐", "崎", "滋",
        "縄", "茨", "媛", "岡", "熊",
        "埼", "鹿", "栃", "奈", "梨",
        "阪", "阜"
    ]
    
    let onYomi:[String] = [
        
    ]
    
    let kunYomi:[String] = [
        
    ]
    
    let definition:[String] = [
        
    ]
    
    let example:[String] = [
        
    ]
} // End of struct Grade4
