//
//  Grade6.swift
//  PracticalJapanese
//
//  Created by Ryan Kanno on 2/20/21.
//  Copyright © 2021 Ryan Kanno. All rights reserved.
//

import Foundation

struct Grade6 {
    let kanji:[String] = [
        "胃", "律", "腸", "恩", "券",
        "承", "舌", "銭", "退", "敵",
        "俵", "預", "異", "遺", "域",
        "宇", "映", "沿", "延", "我",
        "灰", "閣", "革", "拡", "割",
        "株", "簡", "干", "看", "巻",
        "危", "揮", "机", "貴", "疑",
        "吸", "郷", "胸", "供", "筋",
        "勤", "敬", "系", "警", "劇",
        "激", "穴", "絹", "憲", "権",
        "厳", "源", "己", "呼", "誤",
        "孝", "皇", "后", "紅", "鋼",
        "降", "穀", "刻", "骨", "困",
        "砂", "座", "済", "裁", "策",
        "冊", "蚕", "誌", "視", "私",
        "詞", "至", "姿", "磁", "捨",
        "射", "尺", "若", "樹", "宗",
        "収", "衆", "就", "従", "縦",
        "縮", "熟", "純", "署", "処",
        "諸", "除", "傷", "障", "将",
        "蒸", "針", "仁", "推", "垂",
        "寸", "誠", "聖", "盛", "専",
        "宣", "染", "泉", "洗", "善",
        "層", "装", "奏", "繰", "創",
        "窓", "蔵", "臓", "尊", "存",
        "宅", "探", "担", "誕", "暖",
        "段", "値", "宙", "忠", "著",
        "潮", "頂", "庁", "賃", "痛",
        "展", "党", "討", "糖", "届",
        "難", "乳", "認", "脳", "納",
        "派", "肺", "背", "俳", "拝",
        "班", "晩", "否", "秘", "批",
        "腹", "奮", "陛", "並", "閉",
        "補", "暮", "訪", "宝", "棒",
        "忘", "亡", "枚", "幕", "密",
        "盟", "模", "訳", "優", "郵",
        "幼", "翌", "欲", "卵", "乱",
        "覧", "裏", "臨", "論", "朗",
        "片"
    ]
    
    let onYomi:[String] = [
        
    ]
    
    let kunYomi:[String] = [
        
    ]
    
    let definition:[String] = [
        
    ]
    
    let example:[String] = [
        
    ]
} // End of struct Grade6
