//
//  GradeTwo.swift
//  PracticalJapanese
//
//  Created by Ryan Kanno on 2/20/21.
//  Copyright © 2021 Ryan Kanno. All rights reserved.
//

import Foundation

struct Grade2 {
    let kanji:[String] = [
        "夏", "秋", "春", "冬", "話",
        "引", "羽", "雲", "遠", "園",
        "家", "何", "科", "歌", "来",
        "画", "会", "回", "海", "絵",
        "外", "角", "楽", "活", "間",
        "顔", "岩", "丸", "記", "汽",
        "帰", "弓", "牛", "魚", "教",
        "強", "近", "今", "兄", "形",
        "京", "計", "原", "言", "元",
        "古", "戸", "語", "午", "後",
        "広", "交", "工", "光", "公",
        "考", "黄", "行", "高", "合",
        "国", "谷", "黒", "細", "才",
        "作", "算", "紙", "矢", "姉",
        "市", "止", "時", "寺", "自",
        "色", "室", "社", "弱", "首",
        "週", "書", "少", "理", "思",
        "場", "食", "新", "親", "心",
        "図", "頭", "数", "西", "星",
        "声", "晴", "雪", "切", "船",
        "線", "前", "組", "走", "太",
        "多", "体", "台", "弟", "池",
        "地", "知", "茶", "昼", "長",
        "朝", "鳥", "直", "通", "点",
        "店", "電", "刀", "当", "里",
        "答", "東", "道", "同", "読",
        "内", "南", "肉", "馬", "買",
        "売", "麦", "半", "番", "父",
        "歩", "風", "分", "聞", "米",
        "母", "方", "北", "毎", "妹",
        "万", "鳴", "明", "毛", "門",
        "野", "夜", "友", "曜", "用"
    ]
    
    let onYomi:[String] = [
        
    ]
    
    let kunYomi:[String] = [
        
    ]
    
    let definition:[String] = [
        
    ]
    
    let example:[String] = [
        
    ]
} // End of struct Grade2
