//
//  Grade5.swift
//  PracticalJapanese
//
//  Created by Ryan Kanno on 2/20/21.
//  Copyright © 2021 Ryan Kanno. All rights reserved.
//

import Foundation

struct Grade5 {
    let kanji:[String] = [
        "囲", "喜", "紀", "救", "型",
        "航", "告", "殺", "史", "士",
        "賞", "象", "貯", "停", "堂",
        "得", "毒", "費", "粉", "脈",
        "歴", "圧", "移", "因", "永",
        "衛", "営", "益", "易", "液",
        "演", "桜", "応", "往", "価",
        "過", "可", "河", "仮", "解",
        "快", "確", "格", "額", "慣",
        "幹", "刊", "眼", "規", "基",
        "寄", "技", "義", "逆", "旧",
        "久", "許", "居", "境", "均",
        "禁", "句", "経", "潔", "険",
        "検", "件", "現", "限", "減",
        "個", "故", "護", "効", "講",
        "構", "鉱", "耕", "厚", "興",
        "混", "査", "災", "採", "妻",
        "際", "再", "在", "罪", "財",
        "雑", "賛", "酸", "支", "資",
        "師", "志", "飼", "枝", "示",
        "似", "識", "質", "謝", "舎",
        "授", "修", "述", "術", "準",
        "序", "証", "招", "常", "状",
        "条", "情", "職", "織", "製",
        "精", "性", "政", "制", "勢",
        "税", "責", "績", "設", "接",
        "絶", "祖", "素", "総", "増",
        "像", "造", "則", "測", "属",
        "損", "貸", "態", "団", "断",
        "築", "張", "程", "提", "適",
        "統", "銅", "導", "独", "任",
        "燃", "能", "破", "犯", "版",
        "判", "肥", "比", "非", "備",
        "評", "貧", "布", "婦", "武",
        "復", "複", "仏", "編", "弁",
        "保", "墓", "豊", "報", "防",
        "暴", "夢", "務", "迷", "綿",
        "輸", "余", "容", "率", "略",
        "留", "領", "貿"
    ]
    
    let onYomi:[String] = [
        
    ]
    
    let kunYomi:[String] = [
        
    ]
    
    let definition:[String] = [
        
    ]
    
    let example:[String] = [
        
    ]
} // End of struct Grade5
