//
//  Grade3.swift
//  PracticalJapanese
//
//  Created by Ryan Kanno on 2/20/21.
//  Copyright © 2021 Ryan Kanno. All rights reserved.
//

import Foundation

struct Grade3 {
    let kanji:[String] = [
        "悪", "安", "暗", "意", "委",
        "医", "育", "員", "飲", "秒",
        "運", "泳", "駅", "横", "央",
        "屋", "温", "荷", "開", "界",
        "階", "館", "感", "寒", "漢",
        "岸", "起", "期", "客", "急",
        "級", "球", "究", "去", "橋",
        "業", "曲", "局", "銀", "苦",
        "区", "具", "宮", "君", "化",
        "軽", "係", "血", "決", "県",
        "研", "湖", "庫", "幸", "向",
        "港", "号", "根", "祭", "皿",
        "指", "始", "歯", "死", "詩",
        "仕", "使", "次", "持", "事",
        "式", "実", "写", "者", "昔",
        "酒", "守", "主", "取", "受",
        "習", "拾", "集", "終", "州",
        "重", "住", "宿", "暑", "所",
        "助", "消", "昭", "章", "商",
        "勝", "乗", "植", "身", "進",
        "申", "深", "真", "神", "世",
        "整", "全", "想", "相", "送",
        "息", "速", "族", "他", "打",
        "代", "対", "待", "第", "題",
        "短", "炭", "談", "着", "注",
        "柱", "調", "帳", "追", "丁",
        "定", "庭", "笛", "鉄", "転",
        "都", "度", "島", "等", "登",
        "湯", "投", "豆", "動", "童",
        "農", "波", "記", "倍", "箱",
        "畑", "発", "反", "板", "坂",
        "悲", "皮", "鼻", "美", "筆",
        "氷", "表", "病", "院", "品",
        "負", "部", "福", "服", "物",
        "平", "返", "勉", "放", "味",
        "命", "面", "問", "薬", "役",
        "由", "油", "遊", "有", "予",
        "葉", "陽", "羊", "洋", "様",
        "落", "旅", "両", "緑", "流",
        "礼", "列", "練", "路", "和",
    ]
    
    let onYomi:[String] = [
        
    ]
    
    let kunYomi:[String] = [
        
    ]
    
    let definition:[String] = [
        
    ]
    
    let example:[String] = [
        
    ]
} // End of struct Grade3
