//
//  GradeOne.swift
//  PracticalJapanese
//
//  Created by Ryan Kanno on 2/20/21.
//  Copyright © 2021 Ryan Kanno. All rights reserved.
//

import Foundation


struct Grade1 {
    let kanji:[String] = [
        "一", "二", "三", "四", "五",
        "六", "七", "八", "九", "十",
        "音", "雨", "円", "王", "花",
        "日", "月", "火", "水", "木", // **********
        "金", "土", "右", "左", "上",
        "下", "貝", "学", "休", "文",
        "玉", "空", "気", "見", "名",
        "犬", "口", "校", "林", "本",
        "山", "子", "糸", "字", "耳",
        "車", "手", "出", "女", "小",
        "正", "森", "人", "立", "百",
        "生", "青", "赤", "石", "夕",
        "千", "先", "川", "草", "早",
        "足", "村", "大", "男", "竹",
        "虫", "中", "町", "天", "田",
        "入", "年", "白", "力", "目"
    ]
    
    let onYomi:[String] = [
        "イチ",
        "ニ",
        "サン",
        "シ",
        "ゴ",
        "ロク",
        "シチ",
        "ハチ",
        "キュウ、ク",
        "ジュウ",
        
        "オン、イン",
        "ウ",
        "エン",
        "オウ",
        "カ"
    ]
    
    let kunYomi:[String] = [
        "ひと、つい",
        "ふた、ふつ",
        "み",
        "よん、よ",
        "いつ",
        "む、むい",
        "なな、なの",
        "や、よう",
        "ここの",
        "と、とう",
        
        "おと、ね",
        "あめ、あま",
        "まる",
        "N/A",
        "はな"
    ]
    
    let definition:[String] = [
        "one",
        "two",
        "three",
        "four",
        "five",
        "six",
        "seven",
        "eight",
        "nine",
        "ten",
        
        "sound",
        "rain",
        "yen, circle",
        "king, ruler, monarch",
        "flower"
    ]
    
    let example:[String] = [
        "一月（いちがつ）、一つ（ひとつ）、一日（ついたち）",
        "二月（にがつ）、二つ（ふたつ）、二日（ふつか）",
        "三月（さんがつ）、三つ（みっつ）、三日（みっか）",
        "四月（しがつ）、四つ（よっつ）、四日（よっか）",
        "五月（ごがつ）、五つ（いつつ）、五日（いつか）",
        "六月（ろくがつ）、六つ（むっつ）、六日（むいか）",
        "七月（しちがつ）、七つ（ななつ）、七日（なのか）",
        "八月（はちがつ）、八つ（やっつ）、八日（ようか）",
        "九月（くがつ）、九つ（ここのつ）、九日（ここのか）",
        "十月（じゅうがつ）、十日（とうか）",
        
        "音楽（おんがく）、母音（ぼいん）、子音（しいん）、音（おと）",
        "雨季（うき）、雨（あめ）",
        "十円（じゅうえん）、円（まる）",
        "王様（おうさま）、王子（おうじ）王女（おうじょ）",
        "花粉（かふん）、花（はな）、花火（はなび）"
    ]
} // End of struct Grade1
